nbd_fio_results/dev-nbd0_2023-07-17_17:16/seq_w_nbd0_16iodepth/1024.txt
write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

write: (groupid=0, jobs=1): err= 0: pid=17574: Mon Jul 17 17:41:21 2023
  write: IOPS=1516, BW=1516MiB/s (1590MB/s)(29.6GiB/20005msec)
    slat (usec): min=27, max=1627, avg=376.91, stdev=160.03
    clat (usec): min=3780, max=15488, avg=10157.31, stdev=1000.14
     lat (usec): min=4276, max=15544, avg=10546.25, stdev=972.80
    clat percentiles (usec):
     |  1.00th=[ 7504],  5.00th=[ 8455], 10.00th=[ 8848], 20.00th=[ 9372],
     | 30.00th=[ 9765], 40.00th=[10028], 50.00th=[10290], 60.00th=[10421],
     | 70.00th=[10683], 80.00th=[10945], 90.00th=[11338], 95.00th=[11600],
     | 99.00th=[12518], 99.50th=[12911], 99.90th=[13566], 99.95th=[14091],
     | 99.99th=[14877]
   bw (  MiB/s): min= 1408, max= 1598, per=99.97%, avg=1515.78, stdev=61.58, samples=40
   iops        : min= 1408, max= 1598, avg=1515.78, stdev=61.58, samples=40
  lat (msec)   : 4=0.01%, 10=39.66%, 20=60.33%
  cpu          : usr=3.91%, sys=5.87%, ctx=212254, majf=0, minf=531
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,30332,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=1516MiB/s (1590MB/s), 1516MiB/s-1516MiB/s (1590MB/s-1590MB/s), io=29.6GiB (31.8GB), run=20005-20005msec

Disk stats (read/write):
  nbd0: ios=0/241001, merge=0/0, ticks=0/2362204, in_queue=2326740, util=99.66%