nbd_fio_results/dev-nbd0_2023-07-17_17:16/seq_w_nbd0_16iodepth/4096.txt
write: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

write: (groupid=0, jobs=1): err= 0: pid=17663: Mon Jul 17 17:42:02 2023
  write: IOPS=374, BW=1498MiB/s (1570MB/s)(29.3GiB/20016msec)
    slat (usec): min=139, max=9700, avg=2632.74, stdev=1118.22
    clat (usec): min=13956, max=52015, avg=40056.45, stdev=1744.73
     lat (usec): min=17622, max=54805, avg=42696.65, stdev=1791.30
    clat percentiles (usec):
     |  1.00th=[35914],  5.00th=[37487], 10.00th=[38011], 20.00th=[39060],
     | 30.00th=[39060], 40.00th=[39584], 50.00th=[40109], 60.00th=[40633],
     | 70.00th=[40633], 80.00th=[41157], 90.00th=[42206], 95.00th=[42730],
     | 99.00th=[44303], 99.50th=[44827], 99.90th=[46924], 99.95th=[47973],
     | 99.99th=[52167]
   bw (  MiB/s): min= 1400, max= 1528, per=99.86%, avg=1495.53, stdev=18.86, samples=40
   iops        : min=  350, max=  382, avg=373.87, stdev= 4.72, samples=40
  lat (msec)   : 20=0.03%, 50=99.96%, 100=0.01%
  cpu          : usr=6.52%, sys=3.70%, ctx=81449, majf=0, minf=46
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.8%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7494,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=1498MiB/s (1570MB/s), 1498MiB/s-1498MiB/s (1570MB/s-1570MB/s), io=29.3GiB (31.4GB), run=20016-20016msec

Disk stats (read/write):
  nbd0: ios=0/237873, merge=0/0, ticks=0/4941060, in_queue=2450326, util=99.50%